app/views/comments/_comment.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 4 ORDER BY "users"."id" ASC LIMIT 1
---
<p>
  Created by: <%= @post.user.first_name %><br />