app/views/comments/_form.html.erb

	  <%= f.label :User %>
	<%= @post.user.first_name %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 3 ORDER BY "users"."id" ASC LIMIT 1