app/views/users/index.html.erb

<%= form_for (@user) do |f| %>
<h2><%= User.first_name %><%= User.last_name %></h2>
---
SELECT "users".* FROM "users"