app/views/posts/index.html.erb

			<p><%= post.created_at %></p>
			<p>User: <%= post.user.first_name %></p>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 3 ORDER BY "users"."id" ASC LIMIT 1

			<p>
			<% post.tags.each do |tag| %>
---
SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."post_id" = ?  [["post_id", 16]]