app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(params[:comment].permit(:user, :body))
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "20"]]
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?)  [["body", "e. pluribus unum "], ["created_at", Thu, 24 Oct 2013 15:50:02 UTC +00:00], ["post_id", 20], ["updated_at", Thu, 24 Oct 2013 15:50:02 UTC +00:00]]