app/controllers/posts_controller.rb

INSERT INTO "posts" ("created_at", "text", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 24 Oct 2013 15:38:34 UTC +00:00], ["text", "blah"], ["title", "Tomtom"], ["updated_at", Thu, 24 Oct 2013 15:38:34 UTC +00:00], ["user_id", 4]]
---
  def create
    @post = Post.new( post_params )
    @post.user = current_user
    if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY "posts"."id" ASC LIMIT 1  [["id", 20]]
SELECT "tags".* FROM "tags"
---
  def show
    @post = Post.find( params[:id] )
    @tags = Tag.all

SELECT "posts".* FROM "posts" ORDER BY created_at DESC LIMIT 5
SELECT "tags".* FROM "tags"
---
  def index
    @posts = Post.order( 'created_at DESC' ).limit( 5 )
    @tags = Tag.all

SELECT "posts".* FROM "posts" ORDER BY created_at DESC
---
  def archives
    @posts = Post.all.order( 'created_at DESC' )