app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "users" SET "encrypted_password" = ?, "updated_at" = ? WHERE "users"."id" = 3  [["encrypted_password", "$2a$10$Byc8UrD4ocotuXgpX0p3nehcEJvRZjiamrA1PYH6Oepc9xcZmb1a2"], ["updated_at", Thu, 24 Oct 2013 16:44:41 UTC +00:00]]
---
  def update
    @user = User.find( params[:id] )
    if @user.update_attributes( user_params )